package com.quadrize.projectzomboidcookbook


data class Recipe(
    val name: String,
    val difficulty: String,
    val cookingTime: Int,
    val picture: Int,
    val description: String,
    val calories: Int,
    val protein: Int,
    val fats: Int,
    val carbs: Int

) {
}

val recipes = listOf(
    Recipe("Veggie Soup","Easy", 20, R.drawable.soup_bowl,
        "Настоящая классика фермера-одиночки. Запах свежесрезанной капусты и вареного картофеля ненадолго маскирует вонь разложения за окнами твоего убежища. Бульон приятно согревает, а тихий стук кастрюли на плите заглушает далекие стоны мертвецов."
    , 150, 6, 4, 22),
    Recipe("Sandwich","Medium", 15, R.drawable.sandwich,
        "Еда на ходу для тех, кто не планирует задерживаться на одном месте. Два наспех отрезанных ломтя черствеющего хлеба, между которыми зажаты остатки сыра и ветчины из отключенного холодильника. Жевать приходится быстро, не выпуская из рук топор."
    ,350,18,14,35 ),
    Recipe("Taco", "Medium", 15, R.drawable.taco,
        " Хрустящий привет из прошлой, мирной жизни. Достать кукурузные лепешки в округе Нокс — редкая удача. Заверни в них обжаренный фарш с диким чесноком, добавь немного кетчупа, и на пару минут покажется, что ты не выживаешь в глуши, а сидишь в уютной закусочной."
    ,300,15,12,30),
    Recipe("Beans", "Easy", 10, R.drawable.beans_can,
        "Суровое блюдо затяжной зимы. Сладковатый, густой суп из консервированной фасоли, сваренный на костре. Открытая ржавым ножом жестяная банка дарит ту самую углеводную бомбу, которая необходима, чтобы перетаскать еще десяток бревен для забора."
    ,250,12,4,40),
    Recipe("Burger", "Hard", 20, R.drawable.burger,
        "Венец кулинарии выжившего, у которого еще работает генератор. Тяжелая мясная котлета, сок которой пропитывает пышную булочку. Каждый укус — это чистый дофамин, способный излечить даже самую глубокую походную депрессию. Главное, чтобы котлета была не из крысы..."
    ,600,30,35,40),
    Recipe("Sushi", "Medium", 15, R.drawable.sushi,
        " Блюдо для эстетов эпохи апокалипсиса. Рис выращен на грядке, а свежая рыба поймана на самодельную удочку на рассвете. Ломтики филе, аккуратно уложенные поверх клейкого риса. Выглядит дико в условиях разрухи, но на вкус — потрясающе."
    ,250,12,3,40),
    Recipe("Craft Salad", "Hard", 30, R.drawable.craft_salad,
        " Свежесть, добытая потом и кровью на крыше торгового центра. Смесь сочной капусты, редиса и томатов, заправленная оливковым маслом. Легкая, хрустящая еда, которая идеально снимает скуку и возвращает персонажу легкую походку."
    ,180,5,10,20),
    Recipe("Steak", "Medium", 15, R.drawable.steak,
        " Награда за успешную охоту или зачистку мясного магазина. Огромный кусок сочного мяса, поджаренный на старой чугунной сковороде до хрустящей корочки. Он шкворчит в масле, наполняя комнату первобытным ароматом сытости. Лучший способ восполнить силы после тяжелого ранения."
    ,220,32,10,0),
)